// - Дано натуральное число n. Выведите все числа от 1 до n.

// let n = 1;

// while (n <= 10) {
//     console.log('n: ', n);
//     n += 1;
// }



//let rec = (i, n) => {
//    i++;
//    console.log(i);
 //   if ( i > n) {
//        return;
//    }
//    rec(i, n);
//}
//rec(0, 19);
// ===========================================================

// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания,
// если A < B, или в порядке убывания в противном случае.

let a = 1;
let b = 10;
while (a<=b){
    console.log(a);
    a+=1;
}





// ===========================================================
// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]


// ===========================================================
// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]


// ===========================================================

let directArr = [1,2,3];
let reverseArr = (array) => {
    for (let i = directArr.length; i >= 0; i--){
        console.log(directArr[i]);
    };
}
reverseArr();
// numbers = [2,17,13,6,22,31,45,66,100,-18];
// for (let u = numbers.length; u >= 0; u--){
//     console.log(numbers[u]);
// };